ErichStyger/MetaClockClock/Firmware/tinyK22_Master_vs_code/sdk/devices/MK22F51212/drivers/fsl_ftfx_flash.c
    return status;
}

/*!
 * @brief init flash FPROT, XACC registers and Independent flash block
 */
static void flash_init_features(ftfx_config_t *config)
{
    /* Initialize whether flash0 has independent block, protection registers and
     * execute only access registers */
#if (FTFx_FLASH_COUNT > 1U)
    if (config->flashDesc.index == 0U)
#endif
    {
        config->flashDesc.feature.isIndBlock      = 1U;
        config->flashDesc.feature.hasIndPfsizeReg = 1U;
        config->flashDesc.feature.hasIndProtReg   = 1U;
        config->flashDesc.feature.hasIndXaccReg   = 1U;
    }
    /* if another flash exists */
#if defined(FTFx_DRIVER_HAS_FLASH1_SUPPORT) && FTFx_DRIVER_HAS_FLASH1_SUPPORT
    else if (config->flashDesc.index == 1U)
    {
        config->flashDesc.feature.isIndBlock      = FTFx_FLASH1_IS_INDEPENDENT_BLOCK;
        config->flashDesc.feature.hasIndPfsizeReg = config->flashDesc.feature.isIndBlock;
        config->flashDesc.feature.hasIndProtReg   = FTFx_FLASH1_HAS_INT_PROT_REG;
        config->flashDesc.feature.hasIndXaccReg   = FTFx_FLASH1_HAS_INT_XACC_REG;
    }
#endif
#if (FTFx_FLASH_COUNT > 1U)
    else
    {
        /*do nothing*/
    }
#endif
    /* init  protection Registers feature*/
    config->flashDesc.feature.hasProtControl = 1U;
    /* init  Execute-only Access Registers feature*/
    config->flashDesc.feature.hasXaccControl = FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL;
}

/*!
 * @brief Initializes the flash operation config.
 */
static void flash_opsonfig_Init(flash_config_t *config, uint8_t flashIndex)
{
    uint32_t pflashStartAddress;
    uint32_t pflashBlockSize;
    uint32_t pflashBlockCount;
    uint32_t pflashBlockSectorSize;
    uint32_t pfsizeMask;
    uint32_t pfsizeShift;
    uint32_t pflashBlockWriteUnitSize;  /* store P-Flash write unit size */
    uint32_t pflashSectorCmdAlignment;  /* store P-Flash Erase sector command address alignment */
    uint32_t pflashSectionCmdAlignment; /* store Rrogram/Verify section command address alignment */

#if (FTFx_FLASH_COUNT > 1U)
    if (flashIndex == 1U)
    {
        pflashStartAddress        = FLASH1_FEATURE_PFLASH_START_ADDRESS;
        pflashBlockSize           = FLASH1_FEATURE_PFLASH_BLOCK_SIZE;
        pflashBlockCount          = FLASH1_FEATURE_PFLASH_BLOCK_COUNT;
        pflashBlockSectorSize     = FLASH1_FEATURE_PFLASH_BLOCK_SECTOR_SIZE;
        pflashBlockWriteUnitSize  = FLASH1_FEATURE_PFLASH_BLOCK_WRITE_UNIT_SIZE;
        pflashSectorCmdAlignment  = FLASH1_FEATURE_PFLASH_SECTOR_CMD_ADDRESS_ALIGMENT;
        pflashSectionCmdAlignment = FLASH1_FEATURE_PFLASH_SECTION_CMD_ADDRESS_ALIGMENT;
        pfsizeMask                = SIM_FLASH1_PFSIZE_MASK;
        pfsizeShift               = SIM_FLASH1_PFSIZE_SHIFT;
    }
    else
#endif
    {
        pflashStartAddress        = FLASH0_FEATURE_PFLASH_START_ADDRESS; /* get P-Flash start address */
        pflashBlockSize           = FLASH0_FEATURE_PFLASH_BLOCK_SIZE;
        pflashBlockCount          = FLASH0_FEATURE_PFLASH_BLOCK_COUNT;
        pflashBlockSectorSize     = FLASH0_FEATURE_PFLASH_BLOCK_SECTOR_SIZE;
        pflashBlockWriteUnitSize  = FLASH0_FEATURE_PFLASH_BLOCK_WRITE_UNIT_SIZE;
        pflashSectorCmdAlignment  = FLASH0_FEATURE_PFLASH_SECTOR_CMD_ADDRESS_ALIGMENT;
        pflashSectionCmdAlignment = FLASH0_FEATURE_PFLASH_SECTION_CMD_ADDRESS_ALIGMENT;
        pfsizeMask                = SIM_FLASH0_PFSIZE_MASK;
        pfsizeShift               = SIM_FLASH0_PFSIZE_SHIFT;
    }
    /* init current flash start address */
    config->ftfxConfig[flashIndex].flashDesc.blockBase = pflashStartAddress;
    /* init current flash block count */
    config->ftfxConfig[flashIndex].flashDesc.blockCount = pflashBlockCount;
    /* init current flash block sector size */
    config->ftfxConfig[flashIndex].flashDesc.sectorSize = pflashBlockSectorSize;

#if (FTFx_FLASH_COUNT > 1U)
    if ((0U != config->ftfxConfig[flashIndex].flashDesc.feature.isIndBlock) &&
        (0U != config->ftfxConfig[flashIndex].flashDesc.feature.hasIndPfsizeReg))
#endif
    {
        /* Calculate flash memory size based on given parameter */
        config->ftfxConfig[flashIndex].flashDesc.totalSize =
            flash_calculate_mem_size(pflashBlockCount, pflashBlockSize, pfsizeMask, pfsizeShift);
    }
#if (FTFx_FLASH_COUNT > 1U)
    else
    {
        config->ftfxConfig[flashIndex].flashDesc.totalSize = pflashBlockCount * pflashBlockSize;
    }
#endif

    /* init P-Flash write unit size */
    config->ftfxConfig[flashIndex].opsConfig.addrAligment.blockWriteUnitSize = (uint8_t)pflashBlockWriteUnitSize;
    /* init P-Flash Erase sector command address alignment */
    config->ftfxConfig[flashIndex].opsConfig.addrAligment.sectorCmd = (uint8_t)pflashSectorCmdAlignment;
    /* init P-Flash Rrogram/Verify section command address alignment */
    config->ftfxConfig[flashIndex].opsConfig.addrAligment.sectionCmd = (uint8_t)pflashSectionCmdAlignment;
    /* init P-Flash Read resource command address alignment. */
    config->ftfxConfig[flashIndex].opsConfig.addrAligment.resourceCmd =
        (uint8_t)FSL_FEATURE_FLASH_PFLASH_RESOURCE_CMD_ADDRESS_ALIGMENT;
    /* init P-Flash Program check command address alignment. */
    config->ftfxConfig[flashIndex].opsConfig.addrAligment.checkCmd =
        (uint8_t)FSL_FEATURE_FLASH_PFLASH_CHECK_CMD_ADDRESS_ALIGMENT;
    /* init P-Flash swap command address alignment */
    config->ftfxConfig[flashIndex].opsConfig.addrAligment.swapCtrlCmd =
        (uint8_t)FSL_FEATURE_FLASH_PFLASH_SWAP_CONTROL_CMD_ADDRESS_ALIGMENT;
}

#if defined(FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL) && FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL
/*! @brief init access segment feature */
static void flash_access_init(flash_config_t *config, uint8_t flashIndex)
{
    ftfx_spec_mem_t *specMem;

    /* start to initialize the structure of access segment */
#if defined(FTFx_FLASH1_HAS_INT_XACC_REG) && FTFx_FLASH1_HAS_INT_XACC_REG
    specMem = &config->ftfxConfig[flashIndex].flashDesc.accessSegmentMem;
    if (flashIndex == 1U)
    {
        specMem->base  = config->ftfxConfig[flashIndex].flashDesc.blockBase;
        specMem->size  = (uint32_t)kFTFx_AccessSegmentUnitSize << FTFx_FACSSS_REG;
        specMem->count = FTFx_FACSNS_REG;
    }
    else
#else
    specMem = &config->ftfxConfig[0].flashDesc.accessSegmentMem;
#endif /* FTFx_FLASH1_HAS_INT_XACC_REG */
    {
        specMem->base  = config->ftfxConfig[0].flashDesc.blockBase;
        specMem->size  = (uint32_t)kFTFx_AccessSegmentUnitSize << FTFx_FACSS_REG;
        specMem->count = FTFx_FACSN_REG;
    }
}
#endif /* FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL */

/*! @brief init protection feature */
static void flash_protection_init(flash_config_t *config, uint8_t flashIndex)
{
    uint32_t pflashProtectionRegionCount;
#if (FTFx_FLASH_COUNT > 1U)
    uint8_t i;

    if (flashIndex == 1U)
    {
        /* store flash0 Protection region count */
        pflashProtectionRegionCount = FLASH1_FEATURE_PFLASH_PROTECTION_REGION_COUNT;
    }
    else
#endif // #if (FTFx_FLASH_COUNT > 1U)
    {
        /* store flash0 Protection region count */
        pflashProtectionRegionCount = FLASH0_FEATURE_PFLASH_PROTECTION_REGION_COUNT;
    }

    /* Start to initialize the structure of protection features */
    ftfx_spec_mem_t *specMem;
    specMem = &config->ftfxConfig[flashIndex].flashDesc.protectRegionMem;
#if (FTFx_FLASH_COUNT > 1U)
    if (0U != (config->ftfxConfig[flashIndex].flashDesc.feature.hasIndProtReg))
#endif // #if (FTFx_FLASH_COUNT > 1U)
    {
        specMem->base  = config->ftfxConfig[flashIndex].flashDesc.blockBase;
        specMem->count = pflashProtectionRegionCount;
        /* Calculate flash prot segment size */
        specMem->size =
            flash_calculate_prot_segment_size(config->ftfxConfig[flashIndex].flashDesc.totalSize, specMem->count);
    }
#if (FTFx_FLASH_COUNT > 1U)
    else
    {
        uint32_t pflashTotalSize = 0U;
        specMem->base            = config->ftfxConfig[0].flashDesc.blockBase;
        specMem->count           = FLASH0_FEATURE_PFLASH_PROTECTION_REGION_COUNT;
        if (flashIndex == FTFx_FLASH_COUNT - 1U)
        {
            uint32_t segmentSize; /* store the flash protection region count */
            for (i = 0U; i < FTFx_FLASH_COUNT; i++)
            {
                /* get pflash total size*/
                pflashTotalSize += config->ftfxConfig[flashIndex].flashDesc.totalSize;
            }
            /* get pflash port segment size based on parameters */
            segmentSize = flash_calculate_prot_segment_size(pflashTotalSize, specMem->count);
            for (i = 0U; i < FTFx_FLASH_COUNT; i++)
            {
                /* init flash0 and flash1 port segment size */
                config->ftfxConfig[i].flashDesc.protectRegionMem.size = segmentSize;
            }
        }
    }
#endif // #if (FTFx_FLASH_COUNT > 1U)
}

/*!
 * @brief Calculate flash memory size based on given parameter
 */
static uint32_t flash_calculate_mem_size(uint32_t pflashBlockCount,
                                         uint32_t pflashBlockSize,
                                         uint32_t pfsizeMask,
                                         uint32_t pfsizeShift)
{
    uint8_t pfsize = 0xfU;
    uint32_t flashDensity;

#ifndef SIM_FLASH_NOT_USED
    /* PFSIZE=0xf means that on customer parts the IFR was not correctly programmed.
     * We just use the pre-defined flash size in feature file here to support pre-production parts */
    pfsize = (uint8_t)((SIM_FCFG1_REG & pfsizeMask) >> pfsizeShift);
#endif
    if (pfsize == 0xfU)
    {
        flashDensity = pflashBlockCount * pflashBlockSize;
    }
    else
    {
        flashDensity = ((uint32_t)kPFlashDensities[pfsize]) << 10U;
    }

    return flashDensity;
}

/*!
 * @brief Calculate flash prot segment size
 */
static uint32_t flash_calculate_prot_segment_size(uint32_t flashSize, uint32_t segmentCount)
{
    uint32_t segmentSize;

    /* Calculate the size of the flash protection region
     * If the flash density is > 32KB, then protection region is 1/32 of total flash density
     * Else if flash density is < 32KB, then flash protection region is set to 1KB */
    if (flashSize > segmentCount * (uint32_t)kFTFx_MinProtectBlockSize)
    {
        segmentSize = flashSize / segmentCount;
    }
    else
    {
        segmentSize = (uint32_t)kFTFx_MinProtectBlockSize;
    }

    return segmentSize;
}

/*!
 * @brief Validates the given start address and length to get flash index
 */
static status_t flash_check_range_to_get_index(flash_config_t *config,
                                               uint32_t start,
                                               uint32_t lengthInBytes,
                                               uint8_t *flashIndex)
{
    if (config == NULL)
    {
        return kStatus_FTFx_InvalidArgument;
    }

